home/user01/OpenFOAM/OpenFOAM-2.4.0/applications/solvers/my_solvers/icoFoam_phwr/cavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 100;

boundaryField
{
    movingWall
    {
        type            fixedValue;
	value           uniform 300;
    }

    fixedWalls
    {
        type            fixedValue;
	value           uniform 200;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
